tinyNozzle/2D/4_with2outlets_ReCreate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       23784;
    }
    outlet-2
    {
        type            patch;
        nFaces          91;
        startFace       23809;
    }
    outlet-1
    {
        type            patch;
        nFaces          60;
        startFace       23900;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          556;
        startFace       23960;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24150;
        startFace       24516;
    }
)

// ************************************************************************* //
