tinyNozzle/2D/4_with2outlets_ReCreate/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 274;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3673;
    }

    outlet-1
    {
        type            inletOutlet;
        inletValue      uniform 274;
        value           uniform 274;
    }
	
	outlet-2
    {
        type            inletOutlet;
        inletValue      uniform 274;
        value           uniform 274;
    }

    wall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
